{
  "modules": [
    {
      "module": "Cognitivo",
      "activities": [
        {
          "name": "Memoria de colores",
          "description": "Reconocimiento de colores y su secuencia.",
          "stimulus": "visual",
          "difficulty": 1,
          "feedback": "¡Muy bien!",
          "why_useful": "Ayuda a fortalecer la memoria visual y la atención sostenida. Los niños con autismo tienden a aprender mejor mediante la repetición de patrones visuales estructurados.",
          "overstimulation_risk": "Bajo. Evitar colores muy brillantes o cambios de luz rápidos para no generar fatiga visual."
        },
        {
          "name": "Seguir dirección",
          "description": "Una voz dirá una dirección y el usuario debe presionar el botón correspondiente.",
          "stimulus": "auditivo",
          "difficulty": 2,
          "feedback": "¡Excelente!",
          "why_useful": "Mejora la comprensión auditiva, la asociación verbal y la orientación espacial. Refuerza la capacidad de escuchar, procesar y ejecutar instrucciones simples.",
          "overstimulation_risk": "Bajo. Controlar el volumen y evitar repeticiones excesivas del mismo sonido para no causar irritación auditiva."
        },
        {
          "name": "Dibujar la figura",
          "description": "El usuario deberá dibujar una figura que es mencionada en un texto.",
          "stimulus": "visual",
          "difficulty": 3,
          "feedback": "¡Perfecto!",
          "why_useful": "Fortalece la comprensión lectora y la coordinación visomotora. También estimula la interpretación simbólica, un área que puede estar limitada en el espectro autista.",
          "overstimulation_risk": "Bajo. Mantener el entorno visual despejado y el tiempo controlado para evitar frustración."
        }
      ]
    },
    {
      "module": "Sensorial",
      "activities": [
        {
          "name": "Reacción sensorial",
          "description": "El usuario sostiene un objeto que vibra y debe presionar un botón cuando sienta la vibración.",
          "stimulus": "táctil",
          "difficulty": 2,
          "feedback": "¡Excelente!",
          "why_useful": "Favorece la percepción táctil y la relación causa-efecto. Es útil para entrenar la atención y mejorar la respuesta ante estímulos controlados, ayudando a regular la sensibilidad táctil.",
          "overstimulation_risk": "Bajo. Mantener vibraciones suaves y pausadas; evitar estímulos bruscos o intermitentes."
        },
        {
          "name": "Luces que calman",
          "description": "El usuario observará una luz que se mueve lentamente, y debe seguir el movimiento de la misma.",
          "stimulus": "visual",
          "difficulty": 1,
          "feedback": "¡Muy bien, mantuviste la calma!",
          "why_useful": "Estimula la atención visual y la regulación emocional. Los movimientos lentos y predecibles ayudan a calmar la ansiedad y mejorar la concentración.",
          "overstimulation_risk": "Bajo. Usar tonos suaves (azul, verde, lavanda) y evitar parpadeos rápidos o cambios de color intensos."
        },
        {
          "name": "Pulso musical",
          "description": "El usuario toca un botón siguiendo el ritmo de un sonido suave y repetitivo.",
          "stimulus": "auditivo",
          "difficulty": 2,
          "feedback": "¡Buen ritmo!",
          "why_useful": "Ayuda a desarrollar coordinación auditivo-motora, sincronización y autorregulación mediante ritmo constante. También promueve la conciencia corporal.",
          "overstimulation_risk": "Moderado. Mantener volumen medio-bajo y evitar ritmos rápidos o agudos que puedan causar incomodidad auditiva."
        }
      ]
    },
                {
        "module": "Social",
        "activities": [
            {
            "name": "Construye la respuesta",
            "description": "El usuario arma una respuesta social adecuada tocando las palabras en orden.",
            "stimulus": "visual",
            "difficulty": 3,
            "feedback": "¡Excelente! Comunicaste tu respuesta correctamente.",
            "why_useful": "Desarrolla el lenguaje expresivo y la estructura de la conversación.",
            "overstimulation_risk": "Bajo. Evitar presión temporal o colores brillantes."
            },
            {
            "name": "Voz y emoción",
            "description": "Escucha una frase con una emoción y selecciona cuál es la emoción expresada.",
            "stimulus": "auditivo",
            "difficulty": 2,
            "feedback": "¡Excelente oído emocional!",
            "why_useful": "Entrena la interpretación del tono de voz y la empatía auditiva.",
            "overstimulation_risk": "Bajo. Mantener voces naturales y volumen moderado."
            },
            {
            "name": "Empatía en acción",
            "description": "Se presenta una situación y el usuario elige la acción empática más apropiada.",
            "stimulus": "cognitivo",
            "difficulty": 3,
            "feedback": "¡Excelente respuesta empática!",
            "why_useful": "Fortalece la empatía cognitiva y enseña respuestas prosociales.",
            "overstimulation_risk": "Bajo. Usar lenguaje positivo y ritmo tranquilo."
            },
            {
            "name": "Turnos de conversación",
            "description": "Dos usuarios se turnan para continuar una conversación guiada.",
            "stimulus": "auditivo",
            "difficulty": 2,
            "feedback": "¡Buena comunicación en equipo!",
            "why_useful": "Enseña espera de turno, reciprocidad conversacional y escucha activa.",
            "overstimulation_risk": "Bajo. Supervisar ritmo y volumen de las interacciones."
            },
            {
            "name": "Construimos juntos",
            "description": "Dos usuarios cooperan para completar una tarea visual o lógica guiada.",
            "stimulus": "visual",
            "difficulty": 3,
            "feedback": "¡Gran trabajo en equipo!",
            "why_useful": "Refuerza la comunicación funcional, colaboración y confianza social.",
            "overstimulation_risk": "Bajo. Mantener tareas simples y con instrucciones claras."
            },
            {
            "name": "Reflejo social",
            "description": "Un usuario realiza un gesto o movimiento, y su compañero debe imitarlo.",
            "stimulus": "visual",
            "difficulty": 2,
            "feedback": "¡Perfecta sincronía!",
            "why_useful": "Mejora la atención conjunta y la imitación social, claves en la empatía corporal.",
            "overstimulation_risk": "Bajo. Evitar gestos rápidos o sobreexigencia física."
            }
        ]
        },
        {
        "module": "tecnico",
        "activities": [
          {
            "name": "Paso a paso: la ciencia de la vida diaria",
            "description": "Organiza los pasos de tareas comunes en orden lógico.",
            "stimulus": "cognitivo",
            "difficulty": 2,
            "why_useful": "Refuerza el pensamiento secuencial y la lógica cotidiana."
          },
          {
            "name": "Explora el porqué",
            "description": "Responde preguntas sobre cómo funciona el mundo.",
            "stimulus": "cognitivo",
            "difficulty": 2,
            "why_useful": "Fomenta la curiosidad y el pensamiento científico."
          },
          {
            "name": "Clasifica por su función",
            "description": "Asocia objetos con su función correspondiente.",
            "stimulus": "visual",
            "difficulty": 3,
            "why_useful": "Refuerza la comprensión funcional de los objetos cotidianos."
          }
        ]
      }



  ]
}

